package Lesson23;

public class СуммаПрописьюOTUS {
    private static final String единицы[][] = {
            {"одна", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"},
            {"один", "два"}};
    private static final String десятки[] = {
            "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
            "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    private static final String уникальныеДесятки[] = {
            "двадцать", "тридцать", "сорок", "пятьдесят",
            "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    private static final String сотни[] = {
            "сто", "двести", "триста", "четыреста", "пятьсот",
            "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    private static final String валюта[][] = {
            {"копейка", "копейки", "копеек", "0"},
            {"рубль", "рубля", "рублей", "1"},
            {"цент", "цента", "центов", "0"},
            {"доллар", "доллара", "долларов", "1"},
            {"евроцент", "евроцента", "евроцентов", "0"},
            {"евро", "евро", "евро", "1"},
    };
    private static String[][] изменитьВалюту() {
//        ручное указание валюты
        String текущаяВалюта = "";
        Integer y;
        switch (текущаяВалюта) {
            case ("USD"):
                y =2;
                break;
            case ("EURO"):
                y =4;
                break;
            default:
                y =0;
                break;
        }

        String[][] словоформы = new String[][] {
                {валюта[y][0], валюта[y][1], валюта[y][2], "0"},
                {валюта[y +1][0], валюта[y +1][1], валюта[y +1][2], "1"},
                {"тысяча", "тысячи", "тысяч", "0"},
                {"миллион", "миллиона", "миллионов", "1"},
        };
        return словоформы;
    };

    private static String числоВстроку(long колво, int уровень) {
        String[][] словоформы = изменитьВалюту();
        StringBuilder слова = new StringBuilder(50);
        if (колво == 0)
            слова.append("ноль ");
        int тип = словоформы[уровень][3].indexOf("1") + 1;
        int текущийСегмент = (int) (колво % 1000);
        int сотни = текущийСегмент / 100;
        if (сотни > 0)
            слова.append(СуммаПрописьюOTUS.сотни[сотни - 1]).append(" ");
        int десятки = текущийСегмент % 100;
        сотни = десятки / 10;
        десятки = десятки % 10;
        switch (сотни) {
            case 0:
                break;
            case 1:
                слова.append(СуммаПрописьюOTUS.десятки[десятки]).append(" ");
                break;
            default:
                слова.append(уникальныеДесятки[сотни - 2]).append(" ");
        }
        if (сотни == 1)
            десятки = 0;
        switch (десятки) {
            case 0:
                break;
            case 1:
            case 2:
                слова.append(единицы[тип][десятки - 1]).append(" ");
                break;
            default:
                слова.append(единицы[0][десятки - 1]).append(" ");
        }
        switch (десятки) {
            case 1:
                слова.append(словоформы[уровень][0]);
                break;
            case 2:
            case 3:
            case 4:
                слова.append(словоформы[уровень][1]);
                break;
            default:
                if ((текущийСегмент != 0) || ((текущийСегмент == 0) && (уровень == 1)))
                    слова.append(словоформы[уровень][2]);
        }
        long следующееЧисло = колво / 1000;
        if (следующееЧисло > 0) {
            return (числоВстроку(следующееЧисло, уровень + 1) + " " + слова.toString()).trim();
        } else {
            return слова.toString().trim();
        }
    }

    public String перевестиВстроку(double денежка) {
        String[][] словоформы = изменитьВалюту();
        if (денежка < 0.0)
            return "Ошибка, отрицательное значение";
        String копейки = String.format("%.2f", денежка);
        String значКопеек = копейки.substring(копейки.length() - 2, копейки.length());
        int индексКопеек;
        switch (значКопеек.substring(1)) {
            case "1":
                индексКопеек = 0;
                break;
            case "2":
            case "3":
            case "4":
                индексКопеек = 1;
                break;
            default:
                индексКопеек = 2;
        }
        long колво = (long) Math.floor(денежка);
        if (колво < 1000000l) {
            return числоВстроку(колво, 1) + " " + значКопеек + " " + словоформы[0][индексКопеек];
        } else
            return "Ошибка число больше чем 1000000l ...";
    }
}